# CannotConvertInstWorkPlaneToHost Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CannotConvertInstWorkPlaneToHost Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Can't convert Instance's Work Plane to Host. Try resetting Work Plane to a Level.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotConvertInstWorkPlaneToHost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotConvertInstWorkPlaneToHost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotConvertInstWorkPlaneToHost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace